ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_sd_host.h
/***************************************************************************//**
* \file cy_sd_host.h
* \version 1.20
*
*  This file provides constants and parameter values for 
*  the SD Host Controller driver.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_sd_host
* \{
* This driver provides the user an easy method for accessing standard 
* Host Controller Interface (HCI) registers and provides some simple
* functionality on top of the HCI for reading and writing data to 
* an SD card, eMMc card or a SDIO device.
*
* The functions and other declarations used in this driver are in cy_sd_host.h. 
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions 
* and declarations in the PDL. 
*
* Features:
* * Supports data transfer using CPU, SDMA, ADMA2 and ADMA3 modes
* * Supports a configurable block size (1 to 65,535 Bytes)
* * Supports interrupt enabling and masking
* * Supports SD-HCI Host version 4 mode or less
* * Compliant with the SD 6.0, SDIO 4.10 and eMMC 5.1 specifications and earlier versions
* * SD interface features:
* * - Supports the 4-bit interface
* * - Supports Ultra High Speed (UHS-I) mode
* * - Supports Default Speed (DS), High Speed (HS), SDR12, SDR25 and SDR50 speed modes
* * - Supports SDIO card interrupts in both 1-bit and 4-bit modes 
* * - Supports Standard capacity (SDSC), High capacity (SDHC) 
* and Extended capacity (SDXC) memory
* * - Supports CRC and check for command and data packets
* * - Supports packet timeouts
* * - Handles the SDIO card interrupt
* * eMMC interface features:
* * - Supports 1-bit/4-bit/8-bit interfaces
* * - Supports legacy and High Speed SDR speed modes
* * - Supports CRC and check for command and data packets
* * - Supports packet timeouts
*
* Unsupported Features:  
* * Wrap address transfers
* * eMMC boot operation
* * Suspend/Resume operation in an SDIO card
* * Operation in SDR104, UHS-II mode, High Speed DDR, HS200, and HS400
* * Serial Peripheral Interface (SPI) protocol mode
* * Interrupt input pins for the embedded SD system
* * Auto-tuning
* * Command queuing
*
* The SD, eMMC, and SDIO cards have the similar physical interface:
* clock, command line, and data lines. 
* The SD card is removable and requires the SD card connector to connect
* to the PSoC device. This connector also has the card_mech_write_prot switch 
* for mechanical write protection and the card_detect_n switch for card detection.
* The eMMC card also has DAT4-DAT7 pins for 8-bit mode and the EMMC_RESET pin.
* \image html sd_card_connector.png
* The driver has a low-level and high-level APIs. 
* The low-level functions provide an easy method to read and write registers. 
* Also, these functions allow valid interaction with an SD Card, eMMC card, 
* and SDIO card.
* The high-level functions provide an easy mechanism to enumerate a device,
* read, write, and erase data. They are RTOS-friendly. 
* When starting a command, these functions do not wait until the command completes. 
* The interrupt and flags are used to check when the transfer completes. 
* This allows to put RTOS delays in the user code.
*
* \section group_sd_host_section_Configuration_Considerations Configuration Considerations
* The SD Host driver configuration can be divided to a number of sequential
* steps listed below:
* * \ref group_sd_host_enable
* * \ref group_sd_host_pins
* * \ref group_sd_host_clock
* * \ref group_sd_host_intr
* * \ref group_sd_host_config
* * \ref group_sd_host_card_init
*
* \note
* The SD Host driver is built on top of the SDHC hardware block. The SDHC1 instance is
* used as an example for all code snippets. Modify the code to match your
* design.
*
* \subsection group_sd_host_enable Enable SD Host
* Enable the SDHC block calling \ref Cy_SD_Host_Enable.
*
* \subsection group_sd_host_pins Assign and Configure Pins
* Only dedicated SD Host pins can be used for SD Host operation. The HSIOM
* register must be configured to connect the block to the pins. Also, the SD Host 
* pins must be configured in Strong Drive, Input buffer on:
*
* \snippet sd_host/snippet/main.c SD_HOST_CFG_PINS
*
* \subsection group_sd_host_clock Assign Clock Source
* The SD Host is sourced from the CLK_HF clock. The clock must be set to 100 MHz:
*
* \snippet sd_host/snippet/main.c SD_HOST_CFG_ASSIGN_CLOCK
*
* \subsection group_sd_host_intr Configure Interrupt (Optional)
* The user can set up the interrupt for SD Host operation. 
* The user is responsible for writing its own Interrupt handler.
* The Interrupt must be called in the interrupt handler for the selected SDHC
* instance. Also this interrupt must be enabled in the NVIC otherwise
* it will not work.
* It is the user's responsibility to clear the normal and error interrupt statuses. 
* The interrupt statuses can be read using \ref Cy_SD_Host_GetNormalInterruptStatus 
* and \ref Cy_SD_Host_GetErrorInterruptStatus. 
* To clear the interrupt statuses, use \ref Cy_SD_Host_ClearNormalInterruptStatus 
* and \ref Cy_SD_Host_ClearErrorInterruptStatus.
*
* \snippet sd_host/snippet/main.c SD_HOST_INTR_A
* \snippet sd_host/snippet/main.c SD_HOST_INTR_B
*
* \subsection group_sd_host_config Configure SD Host
* To set up the SD Host driver, provide the configuration parameters in the
* \ref cy_stc_sd_host_init_config_t structure. Set the emmc parameter to true for 
* the eMMC-device, otherwise set it to false. Set dmaType if DMA mode 
* is used for read/write operations. The other parameters are optional for
* operation. To initialize the driver, call the \ref Cy_SD_Host_Init
* function providing a pointer to the filled \ref cy_stc_sd_host_init_config_t
* structure and allocated \ref cy_stc_sd_host_context_t.
*
* \snippet sd_host/snippet/main.c SD_HOST_CONTEXT
* \snippet sd_host/snippet/main.c SD_HOST_CFG
* 
* The SD, eMMC or SDIO card can be configured using the \ref Cy_SD_Host_InitCard
* function as a pointer to the filled \ref cy_stc_sd_host_sd_card_config_t
* structure and allocated \ref cy_stc_sd_host_context_t.
*
* \subsection group_sd_host_card_init Initialize the card
* Finally, enable the card operation calling 
* \ref Cy_SD_Host_InitCard.
*
* \snippet sd_host/snippet/main.c SD_HOST_ENABLE_CARD_INIT
*
* \section group_sd_host_use_cases Common Use Cases
*
* \subsection group_sd_host_sd_card_mode SD card Operation
* The master API is divided into two categories:
* \ref group_sd_host_high_level_functions and
* \ref group_sd_host_low_level_functions. Therefore, there are two
* methods for initiating SD card transactions using either <b>Low-Level</b> or
* <b>High-Level</b> API.
*
* \subsubsection group_sd_host_master_hl Use High-Level Functions
* Call \ref Cy_SD_Host_Read or \ref Cy_SD_Host_Write to
* communicate with the SD memory device. These functions do not block 
* in DMA mode and only start a transaction. After a transaction starts, 
* the user should check the further data-transaction complete event.
* The example below shows sending and reading data in DMA mode.
*
* \snippet sd_host/snippet/main.c SD_HOST_WRITE_READ_ADMA2
*
* \subsubsection group_sd_host_master_ll Use Low-Level Functions
* Call \ref Cy_SD_Host_InitDataTransfer to initialize the SD block  
* for a data transfer. It does not start a transfer. To start a transfer 
* call \ref Cy_SD_Host_SendCommand after calling this function. 
* If DMA is not used for Data transfer then the buffer needs to be filled 
* with data first if this is a write.
* Wait the transfer complete event.
* ADMA3 mode requires calling \ref Cy_SD_Host_InitDataTransfer to 
* initialize the DMA transaction. The ADMA3 mode example is shown below.
*
* \snippet sd_host/snippet/main.c SD_HOST_WRITE_READ_ADMA3
*
* \subsection group_sd_host_emmc_card_mode eMMC Card Operation
* eMMC cards use the same API for writing and reading data.
* Additionally, eMMC requires configuring GPIO pins for DAT signals
* in 8-bit mode and card_emmc_reset_n pin if needed.
* The emmc member of \ref cy_stc_sd_host_init_config_t structure must 
* be set to "true".
*
* \subsection group_sd_host_sdio_combo_card_mode eMMC SDIO or Combo Card Operation
* \ref Cy_SD_Host_InitCard() initializes all types of cards and 
* automatically detects the card type: SD, SDIO or Combo card.
* SDIO cards have their input-output (I/O) functions that can be 
* controlled using the GPIO driver. 
* Combo Cards can use both I/O and memory API.
*
* \section group_sd_host_lp Low Power Support
* The SD Host does not operate in Hibernate and Deep Sleep modes but it
* can automatically continue write/read operation after restoring from
* Deep Sleep mode. SD CLK must be disabled before going to Deep Sleep mode 
* and can be enabled after wake up from Deep Sleep mode.
* To reduce the power consumption in Active mode, the user can stop 
* the clock of the SD bus but the following interrupts can be allowed: 
* Card Insert, Card Removal and SDIO Interrupt. 
*
* \section group_sd_host_remove_insert SD Card Removal and Insertion
* SD card removal or insertion can be detected by calling 
* \ref Cy_SD_Host_GetNormalInterruptStatus which returns 
* the card removal or card insertion events 
* (CY_SD_HOST_CARD_REMOVAL or CY_SD_HOST_CARD_INSERTION bits). 
* These events should be reset using 
* \ref Cy_SD_Host_ClearNormalInterruptStatus when they occur. 
* When the card is removed, the SDHC block disables the CMD/DAT output. 
* It is recommended to set DAT pins to 
* the Digital High-Z (CY_GPIO_DM_HIGHZ) drive mode when 
* card removal is detected. This can be doing using the GPIO driver. 
* When the card is inserted, the SDHC block automatically disables 
* the card power and clock. After card insertion, 
* the user should set the DAT pins drive mode back to Strong Drive, 
* Input buffer on (CY_GPIO_DM_STRONG), and then call \ref Cy_SD_Host_InitCard.
* \note If CARD_INTERRUPT is enabled and DAT pins are not set to 
* Digital High-Z drive mode then the interrupt will continuously 
* trigger because the DAT1 line is driven low upon card re-insertion. 
* The user will have to detect the card removal in the ISR handler, 
* apply the power to the card using \ref Cy_SD_Host_EnableCardVoltage, 
* set to the DAT pins drive mode to the Digital High-Z (CY_GPIO_DM_HIGHZ) 
* and clear CY_SD_HOST_CARD_INTERRUPT bit
* using \ref Cy_SD_Host_ClearNormalInterruptStatus.
*
* \section group_sd_host_low_voltage_signaling Low Voltage Signaling
* When lowVoltageSignaling is true, the SD Host driver sets UHS-I mode
* during the card initialization. The SD Host driver always starts talking
* to the card at 3.3V and then later switches to 1.8V. There is no internal
* regulator in the PSoC 6 to change SD signals from 3.3V to 1.8V.
* Thus, an external regulator is needed for the VDDIO of the PSoC device 
* to provide the ability to go from 3.3V to 1.8V. 
* The SD Host driver sets the io_volt_sel pin to high which is used to 
* control the external regulator. 
* \image html sd_host_low_voltage_signaling.png
*
* \section group_sd_host_more_information More Information
*
* Refer to the appropriate device technical reference manual (TRM) for 
* a detailed description of the registers.
*
* \section group_sd_host_MISRA MISRA-C Compliance
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>11.4</td>
*     <td>A</td>
*     <td>A cast should not be performed between a pointer to object type and
*         a different pointer to object type.</td>
*     <td>
*         The function \ref Cy_SD_Host_DeepSleepCallback is the callback of
*         the \ref cy_en_syspm_status_t type. The cast operation safety in these
*         functions becomes the user's responsibility because pointers are
*         initialized when the callback is registered in the SysPm driver.</td>
*   </tr>
*   <tr>
*     <td>20.3</td>
*     <td>R</td>
*     <td>The validity of values passed to library functions shall be checked.</td>
*     <td>This violation is not caused by code changes, i.e. is not a regression.</td>
*   </tr>
* </table>
*
* \section group_sd_host_Changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="2"> 1.20</td>
*     <td>Documentation of the MISRA rule violation.</td>
*     <td>MISRA compliance.</td>
*   </tr>
*   <tr>
*     <td>Added the Cy_SD_Host_DeepSleepCallback() function.</td>
*     <td>Driver maintenance.</td>
*   </tr>
*   <tr>
*     <td>1.10</td>
*     <td>The PLL and CLK disable sequence in \ref Cy_SD_Host_DisableSdClk()
*         is changed to disable CLK first.<br>
*         The Low-Power Support section is updated with additional 
*         information about disabling CLK.<br>
*         The context initialization in \ref Cy_SD_Host_Init() is corrected.<br>
*         Updated the Write/Read sequence in \ref Cy_SD_Host_Read() and
*         \ref Cy_SD_Host_Write()functions for non DMA mode.<br>
*     </td>
*     <td>Defect fixing.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sd_host_macros Macros
* \{
* \defgroup group_sd_host_macros_general_purpose General Purpose Macros
* \defgroup group_sd_host_macros_card_states Card States
* \{
* The masks below can be used to check the CURRENT_STATE bitfield 
* of the \ref Cy_SD_Host_GetCardStatus function return value. 
* \}
* \defgroup group_sd_host_macros_card_status Card Status (CMD13) Bits
* \{
* The masks below can be used with the 
* \ref Cy_SD_Host_GetCardStatus function. 
* \}
* \defgroup group_sd_host_macros_scr SCR Register Masks
* \{
* The masks below can be used with the 
* \ref Cy_SD_Host_GetScr function. 
* \}
* \defgroup group_sd_host_macros_cid CID Register Masks
* \{
* The masks below can be used with the 
* \ref Cy_SD_Host_GetCid function. 
* \}
* \defgroup group_sd_host_macros_csd CSD Register Masks
* \{
* The masks below are for CSD Register Version 2.0 and can be
* used with the \ref Cy_SD_Host_GetCsd function.
* \}
* \defgroup group_sd_host_macros_events SD Host Events
* \{
* The constants below can be used with 
* \ref Cy_SD_Host_GetNormalInterruptStatus, 
* \ref Cy_SD_Host_ClearNormalInterruptStatus, 
* \ref Cy_SD_Host_GetErrorInterruptStatus and  
* \ref Cy_SD_Host_ClearErrorInterruptStatus functions. 
* Each event is encoded in a separate bit, and therefore it is possible to
* notify about multiple events.
* \}
* \defgroup group_sd_host_macros_present_status SD Host Present Status
* \{
* The constants below can be used with the 
* \ref Cy_SD_Host_GetPresentState function. 
* Each status is encoded in a separate bit, and therefore it is possible to
* notify about multiple statuses.
* \}
* \}
* \defgroup group_sd_host_functions Functions
* \{
* \defgroup group_sd_host_high_level_functions High-Level
* \defgroup group_sd_host_low_level_functions Low-Level
* \defgroup group_sd_host_interrupt_functions Interrupt
* \}
* \defgroup group_sd_host_data_structures Data Structures
* \defgroup group_sd_host_enums Enumerated Types
*/

#ifndef CY_SD_HOST_PDL_H
#define CY_SD_HOST_PDL_H

#include <stdbool.h>
#include <stddef.h>
#include "cy_device.h"
#include "cy_device_headers.h"
#include "cy_syslib.h"
#include "cy_syspm.h"

#if defined(CY_IP_MXSDHC)

#if defined (__CC_ARM)
    #pragma anon_unions    
#endif

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/**
* \addtogroup group_sd_host_macros_general_purpose
* \{
*/

/** Driver major version */
#define CY_SD_HOST_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_SD_HOST_DRV_VERSION_MINOR       20

