ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_sd_host.h
#define CY_SD_HOST_SCR_DATA_STAT_AFTER_ERASE (0x00008000UL)  /**< Defines the data status after erase, 
                                                               * whether it is '0' or '1' (the status is 
                                                               * card vendor dependent).
                                                               */

#define CY_SD_HOST_SCR_SD_SECURITY          (0x00007000UL)  /**< Describes the security algorithm 
                                                              * supported by the card.
                                                              */

#define CY_SD_HOST_SCR_SD_BUS_WIDTHS        (0x00000F00UL)  /**< Describes all the DAT bus widths that 
                                                              * are supported by this card.
                                                              */                                                              

/** \} group_sd_host_macros_scr */

/**
* \addtogroup group_sd_host_macros_cid
* \{
*/

#define CY_SD_HOST_SCR_CID_MDT              (0x00000FFFUL)  /**< The manufacturing date is composed of 
                                                              * two hexadecimal digits (contained in cid[0]), 
                                                              * one is 8 bits representing the year(y) and the  
                                                              * other is 4 bits representing the month (m).
                                                              * The "m" field [11:8] is the month code. 1 = January.
                                                              * The "y" field [19:12] is the year code. 0 = 2000.
                                                              * As an example, the binary value of the Date field 
                                                              * for production date "April 2018" will be: 
                                                              * 00010010 0100.
                                                              */
                                                              
#define CY_SD_HOST_SCR_CID_PSN_LSB          (0xFFFF0000UL)  /**< The mask for LSB part of the Serial Number 
                                                              * (contained in cid[0]). The Serial Number is 
                                                              * 32 bits of binary number.
                                                              */

#define CY_SD_HOST_SCR_CID_PSN_MSB          (0x0000FFFFUL)  /**< The mask for MSB part of the Serial Number 
                                                              * (contained in cid[1]). The Serial Number is 
                                                              * 32 bits of binary number.
                                                              */
                                                              
#define CY_SD_HOST_SCR_CID_PRV              (0x00FF0000UL)  /**< The product revision is composed of two 
                                                              * Binary Coded Decimal (BCD) digits (contained in cid[1]), 
                                                              * four bits each, representing an "n.m" revision number. 
                                                              * The "n" is the most significant nibble and "m" is the
                                                              * least significant nibble.
                                                              * As an example, the PRV binary value field for product 
                                                              * revision "6.2" will be: 0110 0010b.
                                                              */

#define CY_SD_HOST_SCR_CID_PNM_LSB          (0xFF000000UL)  /**< The mask for LSB part (the first 8 bits) of the 
                                                              * product name (contained in cid[1]). The product 
                                                              * name is a string, 5-character ASCII string. 
                                                              * As an example, the PNM hex value field for product name 
                                                              * "EB1QT" will be: 0x4542315154.
                                                              */
                                                              
#define CY_SD_HOST_SCR_CID_PNM_MSB          (0xFFFFFFFFUL)  /**< The mask for MSB part (the last 32 bits) of the 
                                                              * product name (contained in cid[2]). The product 
                                                              * name is a string, 5-character ASCII string.
                                                              * As an example, the PNM hex value field for product name 
                                                              * "EB1QT" will be: 0x4542315154.
                                                              */

#define CY_SD_HOST_SCR_CID_OID              (0x0000FFFFUL)  /**< The mask for the OID (contained in cid[3]). 
                                                              * The OID is a 2-character ASCII string that
                                                              * identifies the card OEM and/or the card contents 
                                                              * (when used as a distribution media either on ROM or 
                                                              * FLASH cards). The OID number is controlled, defined, 
                                                              * and allocated to a SD Memory Card manufacturer by 
                                                              * the SD-3C, LLC. This procedure is established to ensure 
                                                              * uniqueness of the CID register.
                                                              * As an example, the OID hex value field for the card OEM 
                                                              * "SM" will be: 0x534D.
                                                              */

