ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_sd_host.h
#define CY_SD_HOST_SCR_CID_MID              (0x00FF0000UL)  /**< The mask for the MID (contained in cid[3]). 
                                                              * MID is a 8-bit binary number that identifies the 
                                                              * card manufacturer. The MID number is controlled, 
                                                              * defined, and allocated to a SD Memory Card manufacturer
                                                              * by the SD-3C, LLC. This procedure is established to 
                                                              * ensure uniqueness of the CID register.
                                                              */

/** \} group_sd_host_macros_cid */

/**
* \addtogroup group_sd_host_macros_csd
* \{
*/

#define CY_SD_HOST_CSD_V2_CSD_STRUCTURE     (0x0000FF00UL)  /**< CSD structure (contained in csd[3]) */

#define CY_SD_HOST_CSD_V2_TAAC              (0x0000FF00UL)  /**< The data read access-time (contained in csd[3]).
                                                              * This field is fixed to 0Eh, which indicates 1 ms.
                                                              */

#define CY_SD_HOST_CSD_V2_NSAC              (0x000000FFUL)  /**< The data read access-time in CLK cycles (NSAC*100) 
                                                              * (contained in csd[3]).
                                                              * This field is fixed to 00h. NSAC should not
                                                              * be used to calculate time-out values 
                                                              * for CSD Version 2.0.
                                                              */

#define CY_SD_HOST_CSD_V2_TRAN_SPEED        (0xFF000000UL)  /**< The max. data transfer rate (contained in csd[2]).
                                                              * Equals to 0x32 (25 MHz) or 0x5A (50 MHz).
                                                              */

#define CY_SD_HOST_CSD_V2_CCC               (0x00FFF000UL)  /**< The card command classes (contained in csd[2]).
                                                              * The card command class register CCC defines which 
                                                              * command classes are supported by this card. 
                                                              * A value of 1 in a CCC bit means that the 
                                                              * corresponding command class is supported.
                                                              */

#define CY_SD_HOST_CSD_V2_READ_BL_LEN       (0x00000F00UL)  /**< The max. read data block length (contained in csd[2]).
                                                              * This field is fixed to 9h, which 
                                                              * indicates READ_BL_LEN=512 Byte.
                                                              */

#define CY_SD_HOST_CSD_V2_READ_BL_PARTIAL   (0x00000080UL)  /**< The partial blocks for read allowed (contained in csd[2]).
                                                              * This field is fixed to 0, which indicates 
                                                              * partial block read is inhibited and only unit 
                                                              * of block access is allowed.
                                                              */

#define CY_SD_HOST_CSD_V2_WRITE_BLK_MISALIGN (0x00000040UL)  /**< The write block misalignment (contained in csd[2]).
                                                              * This field is fixed to 0, which indicates 
                                                              * write access crossing physical block boundaries 
                                                              * is always disabled in High Capacity SD Memory Card.
                                                              */

#define CY_SD_HOST_CSD_V2_READ_BLK_MISALIGN (0x00000020UL)  /**< The read block misalignment (contained in csd[2]).
                                                              * This field is fixed to 0, which indicates 
                                                              * read access crossing physical block boundaries 
                                                              * is always disabled in High Capacity SD Memory Card.
                                                              */

#define CY_SD_HOST_CSD_V2_DSR_IMP           (0x00000010UL)  /**< The DSR implemented (contained in csd[2]).
                                                              * Defines if the configurable driver stage is 
                                                              * integrated on the card.
                                                              */

#define CY_SD_HOST_CSD_V2_C_SIZE_MASK       (0x3FFFFF00UL)  /**< The device size (contained in csd[1]).
                                                              * This parameter is used to calculate the 
                                                              * user data area capacity in the SD memory card 
                                                              * (not include the protected area).
                                                              * The user data area capacity is calculated 
                                                              * from C_SIZE as follows:
                                                              * memory capacity = (C_SIZE+1) * 512K byte.
                                                              */

#define CY_SD_HOST_CSD_V2_ERASE_BLK_EN      (0x00000040UL)  /**< The erase single block enable (contained in csd[1]).
                                                              * This field is fixed to 1, which means the 
                                                              * host can erase one or multiple units of 512 bytes.
                                                              */

#define CY_SD_HOST_CSD_V2_SECTOR_SIZE_MSB   (0x0000003FUL)  /**< The MSB of erase sector size (6 MSB bits contained in csd[1]).
                                                              * SECTOR_SIZE is fixed to 7Fh, which indicates 64 KBytes. 
                                                              * This value does not relate to erase operation. 
                                                              * Version 2.00 cards indicates memory boundary by 
                                                              * AU size and this field should not be used.
                                                              */

