ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_sd_host.h
/** \} group_sd_host_macros_events */

/**
* \addtogroup group_sd_host_macros_present_status
* \{
*/

/**
* Command Inhibit (CMD).
* This bit indicates the following:
* - SD/eMMC mode: If this bit is set to 0, it indicates that the
* CMD line is not in use and the Host controller can issue
* an SD/eMMC command using the CMD line. This bit is
* set when the command register is written. This bit is
* cleared when the command response is received. This bit
* is not cleared by the response of auto CMD12/23 but
* cleared by the response of the Read/Write command.
*/
#define CY_SD_HOST_CMD_INHIBIT             (0x00000001UL)

/**
* Command Inhibit (DAT).
* This bit is applicable for SD/eMMC mode and is generated if
* either the DAT line active or Read transfer active is set to 1. If
* this bit is set to 0, it indicates that the Host Controller can
* issue subsequent SD/eMMC commands. 
*/
#define CY_SD_HOST_CMD_CMD_INHIBIT_DAT     (0x00000002UL)

/**
* DAT Line Active (SD/eMMC Mode only).
* This bit indicates whether one of the DAT lines on the
* SD/eMMC bus is in use.
* For Read transactions, this bit indicates whether a
* read transfer is executing on the SD/eMMC bus.
* For Write transactions, this bit indicates whether a
* write transfer is executing on the SD/eMMC bus.
* For a command with the Busy status, this status indicates whether the
* command executing busy is executing on an SD or eMMC
* bus. 
*/
#define CY_SD_HOST_DAT_LINE_ACTIVE         (0x00000004UL)

/**
* DAT[7:4] Line Signal Level.
* These bits are used to check the DAT line level to recover from
* errors and for debugging. These bits reflect the value of the
* sd_dat_in (upper nibble) signal. 
*/
#define CY_SD_HOST_DAT_7_4                 (0x000000F0UL)

/**
* Write Transfer Active
* This status indicates whether the Write transfer is active for
* SD/eMMC mode.
*/
#define CY_SD_HOST_WR_XFER_ACTIVE          (0x00000100UL)

/**
* Read Transfer Active.
* This bit indicates whether the Read transfer is active for
* SD/eMMC mode.
*/
#define CY_SD_HOST_RD_XFER_ACTIVE          (0x00000200UL)

/**
* Buffer Write Enable.
* This bit is used for non-DMA transfers. This bit is set if space
* is available for writing data.
*/
#define CY_SD_HOST_BUF_WR_ENABLE           (0x00000400UL)

/**
* Buffer Read Enable.
* This bit is used for non-DMA transfers. This bit is set if valid
* data exists in the Host buffer.
*/
#define CY_SD_HOST_BUF_RD_ENABLE           (0x00000800UL)

/**
* Card Inserted.
* This bit indicates whether a card has been inserted. The
* Host Controller debounces this signal so that the Host Driver
* does not need to wait for the signal to stabilize.
*/
#define CY_SD_HOST_CARD_INSERTED           (0x00010000UL)

/**
* Card Stable.
* This bit indicates the stability of the Card Detect Pin Level. A
* card is not detected if this bit is set to 1 and the value of the
* CARD_INSERTED bit is 0.
*/
#define CY_SD_HOST_CARD_STABLE             (0x00020000UL)

/**
* Card Detect Pin Level.
* This bit reflects the inverse synchronized value of the
* card_detect_n signal.
*/
#define CY_SD_HOST_CARD_DETECT_PIN_LEVEL   (0x00040000UL)

/**
* Write Protect Switch Pin Level.
* This bit is supported only for memory and combo cards. This
* bit reflects the synchronized value of the card_write_prot
* signal.
*/
#define CY_SD_HOST_WR_PROTECT_SW_LVL       (0x00080000UL)

/**
* DAT[3:0] Line Signal Level.
* This bit is used to check the DAT line level to recover from
* errors and for debugging. These bits reflect the value of the
* sd_dat_in (lower nibble) signal.
*/
#define CY_SD_HOST_DAT_3_0                 (0x00F00000UL)

/**
* Command-Line Signal Level.
* This bit is used to check the CMD line level to recover from
* errors and for debugging. These bits reflect the value of the
* sd_cmd_in signal.
*/
#define CY_SD_HOST_CMD_LINE_LVL            (0x01000000UL)

/**
* Host Regulator Voltage Stable.
* This bit is used to check whether the host regulator voltage is
* stable for switching the voltage of UHS-I mode. This bit
* reflects the synchronized value of the host_reg_vol_stable
* signal.
*/
#define CY_SD_HOST_HOST_REG_VOL            (0x02000000UL)

/**
* Command Not Issued by Error.
* This bit is set if a command cannot be issued after setting
* the command register due to an error except an Auto
* CMD12 error.
*/
#define CY_SD_HOST_CMD_ISSU_ERR            (0x08000000UL)

/**
* Sub Command Status.
* This bit is used to distinguish between a main command and
* a sub command status.
*/
#define CY_SD_HOST_SUB_CMD_STAT            (0x10000000UL)

/**
* In Dormant Status.
* This bit indicates whether UHS-II lanes enter the Dormant state
* in the UHS-II mode. For SD/eMMC mode, this bit always
* returns 0.
*/
#define CY_SD_HOST_IN_DORMANT_ST           (0x20000000UL)

/**
* Lane Synchronization.
* This bit indicates whether a lane is synchronized in UHSII
* mode. For SD/eMMC mode, this bit always returns 0.
*/
#define CY_SD_HOST_LANE_SYNC               (0x40000000UL)

/**
* UHS-II Interface Detection.
* This bit indicates whether a card supports the UHS-II
* interface. For SD/eMMC mode, this bit always returns 0.
*/
#define CY_SD_HOST_UHS2_IF_DETECT          (0x80000000UL)

/** \} group_sd_host_macros_present_status */


/**
* \addtogroup group_sd_host_enums
* \{
*/

/******************************************************************************
 * Enumerations
 *****************************************************************************/
 
/** SD command types. */                 
typedef enum
{
    CY_SD_HOST_CMD_NORMAL     = 0U,  /**< Other commands */
    CY_SD_HOST_CMD_SUSPEND    = 1U,  /**< CMD52 for writing "Bus Suspend" in CCCR */
    CY_SD_HOST_CMD_RESUME     = 2U,  /**< CMD52 for writing "Function Select" in CCCR */
    CY_SD_HOST_CMD_ABORT      = 3U  /**< CMD12, CMD52 for writing "I/O Abort" in CCCR */
}cy_en_sd_host_cmd_type_t;

/** SD Host auto command enable selection. */
typedef enum
{
    CY_SD_HOST_AUTO_CMD_NONE  = 0U,  /**< Auto command disable. */ 
    CY_SD_HOST_AUTO_CMD_12    = 1U,  /**< Auto command 12 enable. */
    CY_SD_HOST_AUTO_CMD_23    = 2U,  /**< Auto command 23 enable. */
    CY_SD_HOST_AUTO_CMD_AUTO  = 3U   /**< Auto command Auto enable. */
}cy_en_sd_host_auto_cmd_t;

/** SD Host reset types. */
typedef enum
{
    CY_SD_HOST_RESET_DATALINE = 0U, /**< Reset the data circuit only. */
    CY_SD_HOST_RESET_CMD_LINE = 1U, /**< Reset the command circuit only. */  
    CY_SD_HOST_RESET_ALL      = 2U  /**< Reset the whole SD Host controller. */ 
}cy_en_sd_host_reset_t;

/** SD Host error interrupt types. */
typedef enum
{
    CY_SD_HOST_ADMA_ST_STOP   = 0U,   /**< Stop DMA - The SYS_ADR register points to
                                        * a location next to the error descriptor.  
                                        */
    CY_SD_HOST_ADMA_ST_FDS    = 1U,   /**< Fetch Descriptor - The SYS_ADR register
                                        * points to the error descriptor. 
                                        */
    CY_SD_HOST_ADMA_ST_TFR    = 3U,   /**< Transfer Data - SYS_ADR register points
                                        * to a location next to the error descriptor. 
                                        */
    CY_SD_HOST_ADMA_LEN_ERR   = 4U   /**< The ADMA Length Mismatch error. */
}cy_en_sd_host_adma_error_t;

/** Auto CMD Status error codes. */
typedef enum 
{
    CY_SD_HOST_AUTO_CMD12_NOT_EXEC         = 0U,  /**< Auto CMD12 Not Executed. */
    CY_SD_HOST_AUTO_CMD_TOUT_ERR           = 1U,  /**< Auto CMD Timeout Error. */
    CY_SD_HOST_AUTO_CMD_CRC_ERR            = 2U,  /**< Auto CMD CRC Error. */
    CY_SD_HOST_AUTO_CMD_EBIT_ERR           = 3U,  /**< Auto CMD End Bit Error. */
    CY_SD_HOST_AUTO_CMD_IDX_ERR            = 4U,  /**< Auto CMD Index Error. */
    CY_SD_HOST_AUTO_CMD_RESP_ERR           = 5U,  /**< Auto CMD Response Error. */
    CY_SD_HOST_CMD_NOT_ISSUED_AUTO_CMD12   = 7U   /**< Command Not Issued By Auto CMD12 Error. */ 
} cy_en_sd_host_auto_cmd_status_t;

/** SD host error codes. */
typedef enum 
{
    CY_SD_HOST_SUCCESS                     = 0U,  /**< Successful. */
    CY_SD_HOST_ERROR                       = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 1U,  /**< Non-specific error code. */
    CY_SD_HOST_ERROR_INVALID_PARAMETER     = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 2U,  /**< The provided parameter is not valid. */
    CY_SD_HOST_ERROR_OPERATION_IN_PROGRESS = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 3U,  /**< A conflicting or requested operation is still in progress. */
    CY_SD_HOST_ERROR_UNINITIALIZED         = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 4U,  /**< The module (or part of it) was not initialized properly. */
    CY_SD_HOST_ERROR_TIMEOUT               = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 5U,  /**< A Time Out error occurred */
    CY_SD_HOST_OPERATION_INPROGRESS        = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 6U,  /**< The indicator for operation in progress. */
    CY_SD_HOST_ERROR_UNUSABLE_CARD         = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 7U,  /**< The card is unusable. */
    CY_SD_HOST_ERROR_DISCONNECTED          = CY_SD_HOST_ID | CY_PDL_STATUS_ERROR | 8U   /**< The card is disconnected. */
} cy_en_sd_host_status_t;

