ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_sd_host.h
/** SD Host Write/Read structure. */
typedef struct
{
    uint32_t*                     data;            /**< The pointer to data. */
    uint32_t                      address;         /**< The address to Write/Read data on the card or eMMC. */
    uint32_t                      numberOfBlocks;  /**< The number of blocks to Write/Read. */
    cy_en_sd_host_auto_cmd_t      autoCommand;     /**< Selects which auto commands are used if any. */
    uint32_t                      dataTimeout;     /**< The timeout value for the transfer. */
    bool                          enReliableWrite; /**< For EMMC cards, enables the reliable write. */
    bool                          enableDma;       /**< Enables DMA for the transaction. */ 
} cy_stc_sd_host_write_read_config_t;

/** Context structure. */
typedef struct
{   
    cy_en_sd_host_dma_type_t      dmaType;      /**< Defines the DMA type to be used. */
    cy_en_sd_host_card_capacity_t cardCapacity; /**< The standard card or the card with the high capacity. */
    uint32_t                      maxSectorNum; /**< The SD card maximum number of the sectors. */  
    uint32_t                      RCA;          /**< The relative card address. */
    cy_en_sd_host_card_type_t     cardType;     /**< The card type. */
    uint32_t                      csd[4];       /**< The Card-Specific Data register. */
}cy_stc_sd_host_context_t;

/** \} group_sd_host_data_structures */


/**
* \addtogroup group_sd_host_high_level_functions
* \{
*/

/******************************************************************************
* Functions
*******************************************************************************/

/* High level section */

cy_en_sd_host_status_t Cy_SD_Host_InitCard(SDHC_Type *base, 
                                           cy_stc_sd_host_sd_card_config_t *config, 
                                           cy_stc_sd_host_context_t *context);
cy_en_sd_host_status_t Cy_SD_Host_Read(SDHC_Type *base, 
                                       cy_stc_sd_host_write_read_config_t *config,
                                       cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_Write(SDHC_Type *base,
                                        cy_stc_sd_host_write_read_config_t *config,
                                        cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_Erase(SDHC_Type *base, 
                                        uint32_t startAddr, 
                                        uint32_t endAddr, 
                                        cy_en_sd_host_erase_type_t eraseType, 
                                        cy_stc_sd_host_context_t const *context);
                                        
/** \} group_sd_host_high_level_functions */ 
                                        
/**
* \addtogroup group_sd_host_low_level_functions
* \{
*/

cy_en_sd_host_status_t Cy_SD_Host_Init(SDHC_Type *base, 
                                       const cy_stc_sd_host_init_config_t* config, 
                                       cy_stc_sd_host_context_t *context);
void Cy_SD_Host_DeInit(SDHC_Type *base);
void Cy_SD_Host_Enable(SDHC_Type *base);
void Cy_SD_Host_Disable(SDHC_Type *base);
__STATIC_INLINE void Cy_SD_Host_EnableSdClk(SDHC_Type *base);
__STATIC_INLINE void Cy_SD_Host_DisableSdClk(SDHC_Type *base);
cy_en_sd_host_status_t Cy_SD_Host_SetSdClkDiv(SDHC_Type *base, uint16_t clkDiv);
bool Cy_SD_Host_IsWpSet(SDHC_Type const *base);
cy_en_sd_host_status_t Cy_SD_Host_SetHostBusWidth(SDHC_Type *base, 
                                                  cy_en_sd_host_bus_width_t width);
cy_en_sd_host_status_t Cy_SD_Host_SetBusWidth(SDHC_Type *base, 
                                              cy_en_sd_host_bus_width_t width,
                                              cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_SetHostSpeedMode(SDHC_Type *base, 
                                                  cy_en_sd_host_bus_speed_mode_t speedMode);
cy_en_sd_host_status_t Cy_SD_Host_SetBusSpeedMode(SDHC_Type *base, 
                                                  cy_en_sd_host_bus_speed_mode_t speedMode, 
                                                  cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_SelBusVoltage(SDHC_Type *base, 
                                                bool enable18VSignal, 
                                                cy_stc_sd_host_context_t *context);
void Cy_SD_Host_EnableCardVoltage(SDHC_Type *base);
void Cy_SD_Host_DisableCardVoltage(SDHC_Type *base);
cy_en_sd_host_status_t Cy_SD_Host_GetResponse(SDHC_Type const *base, 
                                              uint32_t *responsePtr, 
                                              bool largeResponse);
cy_en_sd_host_status_t Cy_SD_Host_SendCommand(SDHC_Type *base, 
                                              cy_stc_sd_host_cmd_config_t const *config);
cy_en_sd_host_status_t Cy_SD_Host_InitDataTransfer(SDHC_Type *base, 
                                                   cy_stc_sd_host_data_config_t const *dataConfig);
__STATIC_INLINE uint32_t Cy_SD_Host_BufferRead(SDHC_Type const *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_BufferWrite(SDHC_Type *base, uint32_t data);
void Cy_SD_Host_ChangeIoVoltage(SDHC_Type *base, cy_en_sd_host_io_voltage_t ioVoltage);
__STATIC_INLINE void Cy_SD_Host_StopAtBlockGap(SDHC_Type *base);
__STATIC_INLINE void Cy_SD_Host_ContinueFromBlockGap(SDHC_Type *base);
__STATIC_INLINE uint32_t Cy_SD_Host_GetAutoCmdErrStatus(SDHC_Type const *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_EnableAutoCmd23(SDHC_Type *base);
__STATIC_INLINE void Cy_SD_Host_DisableAutoCmd23(SDHC_Type *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_EnableAsyncInterrupt(SDHC_Type *base);
__STATIC_INLINE void Cy_SD_Host_DisableAsyncInterrupt(SDHC_Type *base);
__STATIC_INLINE uint32_t Cy_SD_Host_GetAdmaErrorStatus(SDHC_Type const *base);
__STATIC_INLINE void Cy_SD_Host_EMMC_Reset(SDHC_Type *base);
cy_en_sd_host_status_t Cy_SD_Host_AbortTransfer(SDHC_Type *base,
                                                cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_WriteProtect(SDHC_Type *base, 
                                               cy_en_sd_host_write_protect_t writeProtect,
                                               cy_stc_sd_host_context_t *context);
uint32_t Cy_SD_Host_GetCardStatus(SDHC_Type *base, cy_stc_sd_host_context_t const *context);
cy_en_sd_host_status_t Cy_SD_Host_GetSdStatus(SDHC_Type *base, 
                                              uint32_t *sdStatus,
                                              cy_stc_sd_host_context_t const *context);
uint32_t Cy_SD_Host_GetOcr(SDHC_Type *base,
                           cy_stc_sd_host_context_t *context);
cy_en_sd_host_status_t Cy_SD_Host_GetCid(SDHC_Type *base, uint32_t *cid);
cy_en_sd_host_status_t Cy_SD_Host_GetCsd(SDHC_Type *base, 
                                         uint32_t *csd, 
                                         cy_stc_sd_host_context_t *context);
cy_en_sd_host_status_t Cy_SD_Host_GetExtCsd(SDHC_Type *base, 
                                            uint32_t *extCsd, 
                                            cy_stc_sd_host_context_t *context);
uint32_t Cy_SD_Host_GetRca(SDHC_Type *base);
cy_en_sd_host_status_t Cy_SD_Host_GetScr(SDHC_Type *base, 
                                         uint32_t *scr, 
                                         cy_stc_sd_host_context_t const *context);
uint32_t Cy_SD_Host_GetPresentState(SDHC_Type const *base);
bool Cy_SD_Host_IsCardConnected(SDHC_Type const *base);
void Cy_SD_Host_SoftwareReset(SDHC_Type *base, cy_en_sd_host_reset_t reset);
cy_en_syspm_status_t Cy_SD_Host_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, 
                                                  cy_en_syspm_callback_mode_t mode);

/** \} group_sd_host_low_level_functions */

/**
* \addtogroup group_sd_host_interrupt_functions
* \{
*/

__STATIC_INLINE uint32_t Cy_SD_Host_GetNormalInterruptStatus(SDHC_Type const *base);
__STATIC_INLINE void Cy_SD_Host_ClearNormalInterruptStatus(SDHC_Type *base, uint32_t status);
__STATIC_INLINE void Cy_SD_Host_SetNormalInterruptEnable(SDHC_Type *base, uint32_t interrupt);
__STATIC_INLINE uint32_t Cy_SD_Host_GetNormalInterruptEnable(SDHC_Type const *base);
__STATIC_INLINE void Cy_SD_Host_SetNormalInterruptMask(SDHC_Type *base, uint32_t interruptMask);
__STATIC_INLINE uint32_t Cy_SD_Host_GetNormalInterruptMask(SDHC_Type const *base);
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptStatus(SDHC_Type const *base);
__STATIC_INLINE void Cy_SD_Host_ClearErrorInterruptStatus(SDHC_Type *base, uint32_t status);
__STATIC_INLINE void Cy_SD_Host_SetErrorInterruptEnable(SDHC_Type *base, uint32_t interrupt);
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptEnable(SDHC_Type const *base);
__STATIC_INLINE void Cy_SD_Host_SetErrorInterruptMask(SDHC_Type *base, uint32_t interruptMask);
__STATIC_INLINE uint32_t Cy_SD_Host_GetErrorInterruptMask(SDHC_Type const *base);

/** \} group_sd_host_interrupt_functions */        

/**
* \addtogroup group_sd_host_low_level_functions
* \{
*/


